MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526TFBGNE/mcu.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB7;
	char           wk8[416];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB8;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB9;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB10;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB11;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB12;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB13;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB14;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB15;
	char           wk9[416];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB16;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB17;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB18;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB19;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB20;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
